In [1]:
import pandas as pd

In [4]:
dict_data = {'학생1': '둘리', '학생2': '또치', '학생3': '도우너', '학생4': '희동이', '학생5': '마이콜'}
s1 = pd.Series(dict_data)
s1

학생1     둘리
학생2     또치
학생3    도우너
학생4    희동이
학생5    마이콜
dtype: object

In [5]:
s2 = pd.Series(['둘리', '또치', '도우너', '희동이', '마이콜'])
s2

0     둘리
1     또치
2    도우너
3    희동이
4    마이콜
dtype: object

In [6]:
s3 = pd.Series(['둘리', '또치', '도우너', '희동이', '마이콜'], index=['학생1', '학생2', '학생3', '학생4', '학생5'])
s3

학생1     둘리
학생2     또치
학생3    도우너
학생4    희동이
학생5    마이콜
dtype: object

In [9]:
dict_data = {'name': ['둘리', '또치', '도우너', '희동이'], 'kor': [90, 80, 70, 70], 'eng':[99,98,97,46], 'mat': [90,70,70,60]}
df = pd.DataFrame(dict_data)
df

  name  kor  eng  mat
0   둘리   90   99   90
1   또치   80   98   70
2  도우너   70   97   70
3  희동이   70   46   60

In [11]:
df2 = df.copy()
df3 = df2.rename(index={0:'st1',1:'st2',2:'st3',3:'st4'}, columns={'name': 'dooly', 'kor': 'doochi', 'eng': 'dounar','mat':'heegong'})
df3

    dooly  doochi  dounar  heegong
st1    둘리      90      99       90
st2    또치      80      98       70
st3   도우너      70      97       70
st4   희동이      70      46       60

In [14]:
df2 = df.set_index('name', inplace=True)
df2

      kor  eng  mat
name
둘리     90   99   90
또치     80   98   70
도우너    70   97   70
희동이    70   46   60

In [15]:
list_data = ['2021-01-02', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data)
sr

0    2021-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [17]:
tup_data = ('영인', '2021-11-15', '여', True)
sr = pd.Series(tup_data, index = ['이름', '생년월일', '성별', '학생여부'])
sr

이름              영인
생년월일    2021-11-15
성별               여
학생여부          True
dtype: object

In [19]:
dict_data = {'c0': [1,2,3], 'c1': [4,5,6], 'c2': [7,8,9], 'c3': [10,11,12], 'c4': [13,14,15] }
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [27]:
df = pd.DataFrame([[15, '남', '덕영중'], [17,'여','수리중']])
df

    0  1    2
0  15  남  덕영중
1  17  여  수리중

In [28]:
print(df[0])
print('-'*50)
df[1]

0    15
1    17
Name: 0, dtype: int64
--------------------------------------------------

0    남
1    여
Name: 1, dtype: object

In [31]:
df = pd.DataFrame([[15, '남', '덕영중'], [17,'여','수리중']], index=['준서','예은'], columns=['나이', '성별', '학교'])
print(df)
print('-'*50)
print(df['나이'])
print('-'*50)
print(df.loc['준서'])

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중
--------------------------------------------------
준서    15
예은    17
Name: 나이, dtype: int64
--------------------------------------------------
나이     15
성별      남
학교    덕영중
Name: 준서, dtype: object

In [34]:
df.index = ['학생1', '학생2']
df.columns = ['연령', '남녀', '소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [35]:
df = pd.DataFrame([
    [15, '남', '덕영중'],
    [17,'여','수리중']
], index=['준서','예은'], columns=['나이','성별','학교'])
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [47]:
df.rename(columns={'나이': '연령', '성별': '남녀', '학교': '소속'}, inplace=True)
df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [49]:
df.rename(index={'준서': '학생1', '예은': '학생2'}, inplace=True)
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [50]:
exam_data ={'수학': [90, 80, 70], '영어': [98, 89, 95], '음악': [85, 95, 100], '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [52]:
df2 = df.copy()
df2.drop('우현', inplace=True)
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [53]:
df3 = df.copy()
df3.drop(['우현','인아'], axis=0, inplace=True)
df3

    수학  영어  음악   체육
서준  90  98  85  100

In [54]:
df4 = df.copy()
df4.drop(['음악','체육'], axis=1, inplace=True)
df4

    수학  영어
서준  90  98
우현  80  89
인아  70  95

In [55]:
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [58]:
label1 = df.loc['서준']
print(label1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [59]:
label2 = df.loc[['서준','우현']]
position2 = df.iloc[[0,1]]
print(label2)
print(position2)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [61]:
math1 = df['수학']
math1

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [68]:
df.loc['서준'][1]

98

In [69]:
df['영어'][0]

98

In [70]:
exam_data ={'이름': ['서준','우현','인아'],
            '수학': [90, 80, 70],
            '영어': [98, 89, 95],
            '음악': [85, 95, 100],
            '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [73]:
music_gym = df[['음악','체육']]
music_gym

    음악   체육
0   85  100
1   95   90
2  100   90

In [77]:
music_gym.loc[1][0] = 100
music_gym

    음악   체육
0   85  100
1  100   90
2  100   90

In [79]:
df.iloc[:]

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [80]:
lst = [[1,2,3,4], [10,11,12,13],[20,21,22,23]]
df = pd.DataFrame(lst)
df

    0   1   2   3
0   1   2   3   4
1  10  11  12  13
2  20  21  22  23

In [83]:
df.rename(index={0: 'one', 1: 'two', 2:'three'}, inplace=True)
df

        0   1   2   3
one     1   2   3   4
two    10  11  12  13
three  20  21  22  23

In [85]:
df.loc['one':'three'][0:3]

        0   1   2   3
one     1   2   3   4
two    10  11  12  13
three  20  21  22  23

In [91]:
df.iloc[:2]

      0   1   2   3
one   1   2   3   4
two  10  11  12  13

In [92]:
exam_data = {'이름': ['서준','우현', '인아'],
             '수학': [90, 80, 70],
             '영어': [98, 89, 95],
             '음악': [85, 95, 100],
             '체육': [100, 90, 90]
            }
df = pd.DataFrame(exam_data)
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [93]:
a = df.loc['서준', '음악']
a

85

In [95]:
g = df.loc[['서준','우현'],['음악','체육']]
g

    음악   체육
이름
서준  85  100
우현  95   90

In [96]:
i = df.loc['서준':'우현','음악':'체육']
i

    음악   체육
이름
서준  85  100
우현  95   90

In [99]:
j = df.iloc[0:2,2:4]
j

    음악   체육
이름
서준  85  100
우현  95   90

In [106]:
df.rename(columns={'이름':0, '수학': 1, '영어': 2, '음악': 3, '체육': 4}, inplace=True)
df

     1   2    3    4
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [116]:
exam_data = {'이름': ['서준','우현', '인아'],
             '수학': [90, 80, 70],
             '영어': [98, 89, 95],
             '음악': [85, 95, 100],
             '체육': [100, 90, 90]
            }
df = pd.DataFrame(exam_data)
df['국어'] = 80
df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

In [117]:
df.국어

0    80
1    80
2    80
Name: 국어, dtype: int64

In [118]:
df.loc[3] = ['동규', 90, 80, 70, 60,90]
df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80
3  동규  90  80   70   60  90

In [147]:
exam_data = {'이름': ['서준','우현', '인아'],
             '수학': [90, 80, 70],
             '영어': [98, 89, 95],
             '음악': [85, 95, 100],
             '체육': [100, 90, 90]
            }
df = pd.DataFrame(exam_data)

In [148]:
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [149]:
df.iloc[0][3] = 80
df

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [150]:
df.loc['서준']['체육'] = 90
df

    수학  영어   음악  체육
이름
서준  90  98   85  90
우현  80  89   95  90
인아  70  95  100  90

In [151]:
df.loc['서준',['음악', '체육']] = 50
df

    수학  영어   음악  체육
이름
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90

In [152]:
df.loc['서준',['음악', '체육']] = 100, 60
df

    수학  영어   음악  체육
이름
서준  90  98  100  60
우현  80  89   95  90
인아  70  95  100  90

In [153]:
df = df.T
df

이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악  100  95  100
체육   60  90   90

In [154]:
df = df.transpose()
df

    수학  영어   음악  체육
이름
서준  90  98  100  60
우현  80  89   95  90
인아  70  95  100  90

In [156]:
ndf = df.set_index(['수학'])
ndf

    영어   음악  체육
수학
90  98  100  60
80  89   95  90
70  95  100  90

In [157]:
ndf = df.set_index(['음악'])
ndf

     수학  영어  체육
음악
100  90  98  60
95   80  89  90
100  70  95  90

In [158]:
ndf = df.set_index(['수학', '음악'])
ndf

        영어  체육
수학 음악
90 100  98  60
80 95   89  90
70 100  95  90

In [174]:
ndf.loc[(90,100)]

영어    98
체육    60
Name: (90, 100), dtype: int64

In [176]:
dict_data = {'c0': [1,2,3], 'c1': [4,5,6], 'c2': [7,8,9], 'c3': [10,11,12], 'c4': [13,14,15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [178]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf2 = df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [179]:
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [181]:
# ndf.loc['r0']
ndf.loc[0]

index    r0
c0        1
c1        4
c2        7
c3       10
c4       13
Name: 0, dtype: object

In [182]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [184]:
ndf = df.sort_index(ascending=True)
ndf

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [189]:
ndf = df.sort_values(by='c1', ascending=False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [190]:
student1 = pd.Series({'국어': 100, '영어': 80, '수학': 90})
student1

국어    100
영어     80
수학     90
dtype: int64

In [191]:
percentage = student1/200
percentage

국어    0.50
영어    0.40
수학    0.45
dtype: float64

In [195]:
stu1 = pd.Series({'국어': 100, '영어': 80, '수학': 90})
stu2 = pd.Series({'수학': 80, '국어': 90, '영어': 80})
add = stu1 + stu2
sub = stu1 - stu2
mul = stu1 * stu2
div = stu1 / stu2

result = pd.DataFrame([add, sub, mul, div], index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [202]:
import numpy as np
stu1 = pd.Series({'국어': np.nan, '영어': 80, '수학': 90})
stu2 = pd.Series({'수학': 80, '국어': 90})

add = stu1 + stu2
sub = stu1 - stu2
mul = stu1 * stu2
div = stu1 / stu2

result = pd.DataFrame([add, sub, mul, div], index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

In [203]:
import seaborn as sns

In [204]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age', 'fare']]
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [205]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [206]:
df.head(10)

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583
6  54.0  51.8625
7   2.0  21.0750
8  27.0  11.1333
9  14.0  30.0708

In [208]:
df.tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [209]:
add = df + 10
add.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [211]:
sr = pd.Series([10, 20, 30, 40, 50])
sr

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [212]:
sr = pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5 })
sr

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [213]:
sr = pd.Series({'학생1': '둘리', '학생2': '또치', '학생3': '도우너', '학생4': '희동이', '학생5': '마이콜'})
sr

학생1     둘리
학생2     또치
학생3    도우너
학생4    희동이
학생5    마이콜
dtype: object

In [214]:
sr = pd.Series(['둘리', '또치', '도우너', '희동이', '마이콜'], index=['학생1', '학생2', '학생3', '학생4', '학생5'])
sr

학생1     둘리
학생2     또치
학생3    도우너
학생4    희동이
학생5    마이콜
dtype: object

In [215]:
blood = ['A형', 'B형', 'O형', 'AB형']
st = [34.2, 27.1, 26.7, 11.5]
sr = pd.Series(st, index=blood)
sr

A형     34.2
B형     27.1
O형     26.7
AB형    11.5
dtype: float64

In [227]:
print(sr[0])
print(sr[-1])
print(sr[1])
print(sr[1:4])

34.2
11.5
27.1
B형     27.1
O형     26.7
AB형    11.5
dtype: float64

In [232]:
print(sr['A형'])
print(sr['AB형'])
print(sr['B형'])
print(sr['B형':'AB형'])

34.2
11.5
27.1
B형     27.1
O형     26.7
AB형    11.5
dtype: float64

In [248]:
print(len(sr))

4

In [244]:
print(sr.index)

Index(['A형', 'B형', 'O형', 'AB형'], dtype='object')

In [243]:
print(sr.values)

[34.2 27.1 26.7 11.5]

In [247]:
df = pd.DataFrame({'name': ['둘리', '또치', '도우너', '희동이'],
                   'kor': [90, 80, 70, 70],
                   'eng': [99, 98, 97, 46],
                   'mat': [90, 70, 70, 60]
})
print('타입: ', type(df))
print(df)

타입:  <class 'pandas.core.frame.DataFrame'>
  name  kor  eng  mat
0   둘리   90   99   90
1   또치   80   98   70
2  도우너   70   97   70
3  희동이   70   46   60

In [253]:
df = pd.DataFrame({'name': ['둘리', '또치', '도우너', '희동이'],
                   'kor': [90, 80, 70, 70],
                   'eng': [99, 98, 97, 46],
                   'mat': [90, 70, 70, 60]
}, index=['학생1', '학생2', '학생3', '학생4'])

print('타입: ', type(df))
print(df)

타입:  <class 'pandas.core.frame.DataFrame'>
    name  kor  eng  mat
학생1   둘리   90   99   90
학생2   또치   80   98   70
학생3  도우너   70   97   70
학생4  희동이   70   46   60

In [255]:
df.rename(index={'학생1':'st1', '학생2':'st2', '학생3': 'st3','학생4': 'st4'}, columns={'name':'dooly', 'kor':'doochi','eng':'dounar','mat':'heedong'}, inplace=True)
df

    dooly  doochi  dounar  heedong
st1    둘리      90      99       90
st2    또치      80      98       70
st3   도우너      70      97       70
st4   희동이      70      46       60

In [272]:
data = {
    'name': ['듀크1', '듀크2', '듀크3', '듀크4', '듀크5', '듀크6', '듀크7'],
    'kor': [90, 80, 70, 70, 60, 70, 90],
    'eng': [99, 98, 97, 46, 77, 56, 90],
    'mat': [90, 70, 70, 60, 88, 99, 90]
}
df = pd.DataFrame(data)
print(df.head())
print(df.tail())
print(df.columns)
print(df['name'])
print(df.eng)
print(df[['kor','mat']])
print(df.iloc[3])
print(df.iloc[0,0])
print(df.iloc[3,2])
print(df.iloc[2:4,2])
print(df.iloc[2:4,2:4])
print(df.loc[3])
print(df.loc[0,'name'])
print(df.loc[3,'eng'])
print(df.loc[[2,3],'eng'])
print(df.loc[[2,3],['eng','mat']])

  name  kor  eng  mat
0  듀크1   90   99   90
1  듀크2   80   98   70
2  듀크3   70   97   70
3  듀크4   70   46   60
4  듀크5   60   77   88
  name  kor  eng  mat
2  듀크3   70   97   70
3  듀크4   70   46   60
4  듀크5   60   77   88
5  듀크6   70   56   99
6  듀크7   90   90   90
Index(['name', 'kor', 'eng', 'mat'], dtype='object')
0    듀크1
1    듀크2
2    듀크3
3    듀크4
4    듀크5
5    듀크6
6    듀크7
Name: name, dtype: object
0    99
1    98
2    97
3    46
4    77
5    56
6    90
Name: eng, dtype: int64
   kor  mat
0   90   90
1   80   70
2   70   70
3   70   60
4   60   88
5   70   99
6   90   90
name    듀크4
kor      70
eng      46
mat      60
Name: 3, dtype: object
듀크1
46
2    97
3    46
Name: eng, dtype: int64
   eng  mat
2   97   70
3   46   60
name    듀크4
kor      70
eng      46
mat      60
Name: 3, dtype: object
듀크1
46
2    97
3    46
Name: eng, dtype: int64
   eng  mat
2   97   70
3   46   60

In [273]:
df.set_index('name', inplace=True)
df

      kor  eng  mat
name
듀크1    90   99   90
듀크2    80   98   70
듀크3    70   97   70
듀크4    70   46   60
듀크5    60   77   88
듀크6    70   56   99
듀크7    90   90   90